<?php require 'header.php';?>




<h4>Задание 1.</h4>
        <p> При помощи языка PHP создайте двумерный массив размером 6х6, 
заполните его числами из последовательности Фибоначчи таким образом, 
чтобы в углу [0][0] была единица, в ячейке [1][0] была единица, в ячейке [2][0] была цифра 2.
Найдите сумму чисел находящихся на диагонали [5][0]-[0][5]</p>
        <p>Посмотреть <a href="/fibb.php" class="btn btn-primary">решение</a></p>
 
<h4>Задание 2.</h4>
<p>Нарисуйте в свободной форме схему следующей БД:
1) есть ученики, учителя и классы
2) каждый ученик учится в каком-то классе
3) учитель может преподавать в одном или более классах
4) в одном классе может преподавать один или более учителей</p>
<p>Посмотреть <a href="/database.php" class="btn btn-primary">решение</a></p>

<h4>Задание 2.</h4>
<p>Написать PHP скрипт, который загружает из интернета любое изображение на ваш выбор,
 в загруженном изображении копирует левую половину изображения,
 зеркально ее отражает и вставляет вместо правой половины изображения. 
Полученый результат должен быть сохранен в ту же папку, где лежит скрипт в формате png.
 Скрипт должен быть назван task3_updated.php</p>
<p>Посмотреть <a href="/task3_updated.php" class="btn btn-primary">решение</a></p>